# Итоговая контрольная работа по основному блоку
### 1. Создать репозиторий на GitHub
### 2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
### 3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
### 4. Написать программу, решающую поставленную задачу
### 5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

# **Задача:**
### *Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*

# Pешение (описание)

1. ### Выводим текст запроса у пользоватиря размер исходгого массива при помощи метода (Console.Write)
2. ### Считываем введенный размер (Console.ReadLine)
3. ### Создаем массив требуемого размера (num) заполненный 0
4. ### Функция string[] CreateArray() вызванная {string.Join()}запрашивает стоки у пользователя, собирает в массив и выводит его на экран. Перед массивом при помощи интерполяцию строк перед массивом выводится текст "Исходный массив:", сам массив выводится через запятую и табуляцию.
5. ### Функция int CheckArray() считает количество элементов в массиве, которые содержат не более 3 символов.
6. ### Функция string[] NewArray() вызванная {string.Join()}, берет исходны массив, проверяет элементы на соответствие количеству символов (<= 3), заполняет этими элементами массив, длинну которого берет из int CheckArray(). Массив выводится его на экран, перед ним при помощи интерполяции строк выводится текст "Конечный массив:", сам массив выводится через запятую и табуляцию.